In [1]:
import pandas as pd
dict={'Name':['Priyang','Krisha','Vedant','Parshv','Archana'],
     'Marks':[98,99,87,90,82]}
df=pd.DataFrame(dict,dtype='float')
df

C:\Users\Dell\AppData\Local\Temp\ipykernel_6304\3478810170.py:4: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(dict,dtype='float')

      Name  Marks
0  Priyang   98.0
1   Krisha   99.0
2   Vedant   87.0
3   Parshv   90.0
4  Archana   82.0

In [2]:
new_series=pd.Series(['AA', 'AA', 'BB', 'AB', 'BB'])
new_series

0    AA
1    AA
2    BB
3    AB
4    BB
dtype: object

In [3]:
df['Grades']=new_series
df

      Name  Marks Grades
0  Priyang   98.0     AA
1   Krisha   99.0     AA
2   Vedant   87.0     BB
3   Parshv   90.0     AB
4  Archana   82.0     BB

In [10]:
new_row={'Name':'Susan','Mary','Marks':90,80}
new_row

SyntaxError: invalid syntax (3299989199.py, line 1)

In [11]:
df=df.append(new_row,ignore_index=True)
df

C:\Users\Dell\AppData\Local\Temp\ipykernel_6304\3769568061.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(new_row,ignore_index=True)

            Name     Marks Grades
0        Priyang      98.0     AA
1         Krisha      99.0     AA
2         Vedant      87.0     BB
3         Parshv      90.0     AB
4        Archana      82.0     BB
5          Susan      90.0    NaN
6  [Susan, Mary]  [90, 80]    NaN
7  [Susan, Mary]  [90, 80]    NaN

In [12]:
df.drop([5,7],inplace=True)

In [13]:
df

            Name     Marks Grades
0        Priyang      98.0     AA
1         Krisha      99.0     AA
2         Vedant      87.0     BB
3         Parshv      90.0     AB
4        Archana      82.0     BB
6  [Susan, Mary]  [90, 80]    NaN

In [14]:
df.drop(6,inplace=True)

In [15]:
df

      Name Marks Grades
0  Priyang  98.0     AA
1   Krisha  99.0     AA
2   Vedant  87.0     BB
3   Parshv  90.0     AB
4  Archana  82.0     BB

In [17]:
df.loc[5]=['Rahu',90,'']

In [18]:
df

      Name Marks Grades
0  Priyang  98.0     AA
1   Krisha  99.0     AA
2   Vedant  87.0     BB
3   Parshv  90.0     AB
4  Archana  82.0     BB
5     Rahu    90

In [19]:
df.drop(5,inplace=True)

In [20]:
df

      Name Marks Grades
0  Priyang  98.0     AA
1   Krisha  99.0     AA
2   Vedant  87.0     BB
3   Parshv  90.0     AB
4  Archana  82.0     BB

In [22]:
row={'Name':'Rahul', 'Marks':90}
row

{'Name': 'Rahul', 'Marks': 90}

In [24]:
df=df.append(row,ignore_index=True)
df

C:\Users\Dell\AppData\Local\Temp\ipykernel_6304\3456989694.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row,ignore_index=True)

      Name Marks Grades
0  Priyang  98.0     AA
1   Krisha  99.0     AA
2   Vedant  87.0     BB
3   Parshv  90.0     AB
4  Archana  82.0     BB
5    Rahul    90    NaN
6    Rahul    90    NaN

## Read CSV file
- pd.read_csv('xxx.csv')

In [27]:
import pandas as pd

In [28]:
data=pd.read_csv('data_#na.csv')
data

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [29]:
data.isnull()

    Name  Marks  Grades
0  False  False    True
1  False   True   False
2  False  False   False
3  False  False    True
4  False  False   False
5  False   True   False
6  False  False   False

# Check null values in data frame
- isnull()
- isnull().sum()
- isna()
- isna().sum()
- notnull()

In [33]:
data.isnull().sum()

Name      0
Marks     2
Grades    2
dtype: int64

In [34]:
data.isnull().sum().sum()

4

In [35]:
data.isna()

    Name  Marks  Grades
0  False  False    True
1  False   True   False
2  False  False   False
3  False  False    True
4  False  False   False
5  False   True   False
6  False  False   False

In [37]:
data.notnull().sum()

Name      7
Marks     5
Grades    5
dtype: int64

In [43]:
data['Marks'].isnull().sum()

2

In [47]:
data[data['Grades'].isnull()]

      Name  Marks Grades
0  Priyang   98.0    NaN
3   Vedant   87.0    NaN

In [49]:
data[data['Marks'].isnull()]

     Name  Marks Grades
1  Aadhya    NaN     AB
5  Mittal    NaN     BA

In [51]:
data[data['Marks'].notnull()]

      Name  Marks Grades
0  Priyang   98.0    NaN
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
6  Archana   82.0     BB